Revit 2024 API
BuiltInFailures.AutoRouteFailures Class
 Failures about AutoRoute.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class AutoRouteFailures
Visual Basic
Public NotInheritable Class AutoRouteFailures
Visual C++
public ref class AutoRouteFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures
See Also
BuiltInFailures.AutoRouteFailures Members
Autodesk.Revit.DB Namespace